rails/app/controllers/api/pairings_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "pairings".* FROM "pairings" INNER JOIN "pairings_users" ON "pairings"."id" = "pairings_users"."pairing_id" WHERE "pairings_users"."user_id" = $1  [["user_id", 1]]
---
  def index
    @pairings = User.find(params[:user_id]).pairings

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "pairings".* FROM "pairings" INNER JOIN "pairings_users" ON "pairings"."id" = "pairings_users"."pairing_id" WHERE "pairings_users"."user_id" = $1  [["user_id", 1]]
---
  def by_user_id
    @pairings = User.find(params[:user_id]).pairings