rails/app/controllers/api/users_controller.rb

  def by_pairing_id
    @users = Pairing.find(params[:pairing_id]).users
---
SELECT  "pairings".* FROM "pairings"  WHERE "pairings"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" INNER JOIN "pairings_users" ON "users"."id" = "pairings_users"."user_id" WHERE "pairings_users"."pairing_id" = $1  [["pairing_id", 1]]